#+title: My Emacs Config
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el :mkdirp yes

* fonts

  Hack font use when on Linux andd Fire code in macos.
  
  ;;(font-family-list)
  #+begin_src emacs-lisp
  (add-to-list 'default-frame-alist
             (cond
              ((string-equal system-type "darwin")    '(font . "Fira Code-14"))
              ((string-equal system-type "gnu/linux") '(font . "Fira Code-12"))))
  #+end_src

  #+RESULTS:
  : ((font . Fira Code-12) (font . Hack Regular 12))

